GopalSaraf/Practicals/PSDL/include/proc/pic18f85j15.inc
// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0FB8h

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0FB9h

// Register: ECCP2CON
#define ECCP2CON ECCP2CON
ECCP2CON                                 equ 0FBAh
// bitfield definitions
ECCP2CON_CCP2M_POSN                      equ 0000h
ECCP2CON_CCP2M_POSITION                  equ 0000h
ECCP2CON_CCP2M_SIZE                      equ 0004h
ECCP2CON_CCP2M_LENGTH                    equ 0004h
ECCP2CON_CCP2M_MASK                      equ 000Fh
ECCP2CON_DC2B_POSN                       equ 0004h
ECCP2CON_DC2B_POSITION                   equ 0004h
ECCP2CON_DC2B_SIZE                       equ 0002h
ECCP2CON_DC2B_LENGTH                     equ 0002h
ECCP2CON_DC2B_MASK                       equ 0030h
ECCP2CON_P2M_POSN                        equ 0006h
ECCP2CON_P2M_POSITION                    equ 0006h
ECCP2CON_P2M_SIZE                        equ 0002h
ECCP2CON_P2M_LENGTH                      equ 0002h
ECCP2CON_P2M_MASK                        equ 00C0h
ECCP2CON_CCP2M0_POSN                     equ 0000h
ECCP2CON_CCP2M0_POSITION                 equ 0000h
ECCP2CON_CCP2M0_SIZE                     equ 0001h
ECCP2CON_CCP2M0_LENGTH                   equ 0001h
ECCP2CON_CCP2M0_MASK                     equ 0001h
ECCP2CON_CCP2M1_POSN                     equ 0001h
ECCP2CON_CCP2M1_POSITION                 equ 0001h
ECCP2CON_CCP2M1_SIZE                     equ 0001h
ECCP2CON_CCP2M1_LENGTH                   equ 0001h
ECCP2CON_CCP2M1_MASK                     equ 0002h
ECCP2CON_CCP2M2_POSN                     equ 0002h
ECCP2CON_CCP2M2_POSITION                 equ 0002h
ECCP2CON_CCP2M2_SIZE                     equ 0001h
ECCP2CON_CCP2M2_LENGTH                   equ 0001h
ECCP2CON_CCP2M2_MASK                     equ 0004h
ECCP2CON_CCP2M3_POSN                     equ 0003h
ECCP2CON_CCP2M3_POSITION                 equ 0003h
ECCP2CON_CCP2M3_SIZE                     equ 0001h
ECCP2CON_CCP2M3_LENGTH                   equ 0001h
ECCP2CON_CCP2M3_MASK                     equ 0008h
ECCP2CON_DC2B0_POSN                      equ 0004h
ECCP2CON_DC2B0_POSITION                  equ 0004h
ECCP2CON_DC2B0_SIZE                      equ 0001h
ECCP2CON_DC2B0_LENGTH                    equ 0001h
ECCP2CON_DC2B0_MASK                      equ 0010h
ECCP2CON_DC2B1_POSN                      equ 0005h
ECCP2CON_DC2B1_POSITION                  equ 0005h
ECCP2CON_DC2B1_SIZE                      equ 0001h
ECCP2CON_DC2B1_LENGTH                    equ 0001h
ECCP2CON_DC2B1_MASK                      equ 0020h
ECCP2CON_P2M0_POSN                       equ 0006h
ECCP2CON_P2M0_POSITION                   equ 0006h
ECCP2CON_P2M0_SIZE                       equ 0001h
ECCP2CON_P2M0_LENGTH                     equ 0001h
ECCP2CON_P2M0_MASK                       equ 0040h
ECCP2CON_P2M1_POSN                       equ 0007h
ECCP2CON_P2M1_POSITION                   equ 0007h
ECCP2CON_P2M1_SIZE                       equ 0001h
ECCP2CON_P2M1_LENGTH                     equ 0001h
ECCP2CON_P2M1_MASK                       equ 0080h
ECCP2CON_CCP2Y_POSN                      equ 0004h
ECCP2CON_CCP2Y_POSITION                  equ 0004h
ECCP2CON_CCP2Y_SIZE                      equ 0001h
ECCP2CON_CCP2Y_LENGTH                    equ 0001h
ECCP2CON_CCP2Y_MASK                      equ 0010h
ECCP2CON_CCP2X_POSN                      equ 0005h
ECCP2CON_CCP2X_POSITION                  equ 0005h
ECCP2CON_CCP2X_SIZE                      equ 0001h
ECCP2CON_CCP2X_LENGTH                    equ 0001h
ECCP2CON_CCP2X_MASK                      equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0FBBh

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0FBBh

// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0FBCh

// Register: ECCP1CON
#define ECCP1CON ECCP1CON
ECCP1CON                                 equ 0FBDh
// bitfield definitions
ECCP1CON_CCP1M_POSN                      equ 0000h
ECCP1CON_CCP1M_POSITION                  equ 0000h
ECCP1CON_CCP1M_SIZE                      equ 0004h
ECCP1CON_CCP1M_LENGTH                    equ 0004h
ECCP1CON_CCP1M_MASK                      equ 000Fh
ECCP1CON_DC1B_POSN                       equ 0004h
ECCP1CON_DC1B_POSITION                   equ 0004h
ECCP1CON_DC1B_SIZE                       equ 0002h
ECCP1CON_DC1B_LENGTH                     equ 0002h
ECCP1CON_DC1B_MASK                       equ 0030h
ECCP1CON_P1M_POSN                        equ 0006h
ECCP1CON_P1M_POSITION                    equ 0006h
ECCP1CON_P1M_SIZE                        equ 0002h
ECCP1CON_P1M_LENGTH                      equ 0002h
ECCP1CON_P1M_MASK                        equ 00C0h
ECCP1CON_CCP1M0_POSN                     equ 0000h
ECCP1CON_CCP1M0_POSITION                 equ 0000h
ECCP1CON_CCP1M0_SIZE                     equ 0001h
ECCP1CON_CCP1M0_LENGTH                   equ 0001h
ECCP1CON_CCP1M0_MASK                     equ 0001h
ECCP1CON_CCP1M1_POSN                     equ 0001h
ECCP1CON_CCP1M1_POSITION                 equ 0001h
ECCP1CON_CCP1M1_SIZE                     equ 0001h
ECCP1CON_CCP1M1_LENGTH                   equ 0001h
ECCP1CON_CCP1M1_MASK                     equ 0002h
ECCP1CON_CCP1M2_POSN                     equ 0002h
ECCP1CON_CCP1M2_POSITION                 equ 0002h
ECCP1CON_CCP1M2_SIZE                     equ 0001h
ECCP1CON_CCP1M2_LENGTH                   equ 0001h
ECCP1CON_CCP1M2_MASK                     equ 0004h
ECCP1CON_CCP1M3_POSN                     equ 0003h
ECCP1CON_CCP1M3_POSITION                 equ 0003h
ECCP1CON_CCP1M3_SIZE                     equ 0001h
ECCP1CON_CCP1M3_LENGTH                   equ 0001h
ECCP1CON_CCP1M3_MASK                     equ 0008h
ECCP1CON_DC1B0_POSN                      equ 0004h
ECCP1CON_DC1B0_POSITION                  equ 0004h
ECCP1CON_DC1B0_SIZE                      equ 0001h
ECCP1CON_DC1B0_LENGTH                    equ 0001h
ECCP1CON_DC1B0_MASK                      equ 0010h
ECCP1CON_DC1B1_POSN                      equ 0005h
ECCP1CON_DC1B1_POSITION                  equ 0005h
ECCP1CON_DC1B1_SIZE                      equ 0001h
ECCP1CON_DC1B1_LENGTH                    equ 0001h
ECCP1CON_DC1B1_MASK                      equ 0020h
ECCP1CON_P1M0_POSN                       equ 0006h
ECCP1CON_P1M0_POSITION                   equ 0006h
ECCP1CON_P1M0_SIZE                       equ 0001h
ECCP1CON_P1M0_LENGTH                     equ 0001h
ECCP1CON_P1M0_MASK                       equ 0040h
ECCP1CON_P1M1_POSN                       equ 0007h
ECCP1CON_P1M1_POSITION                   equ 0007h
ECCP1CON_P1M1_SIZE                       equ 0001h
ECCP1CON_P1M1_LENGTH                     equ 0001h
ECCP1CON_P1M1_MASK                       equ 0080h
ECCP1CON_CCP1Y_POSN                      equ 0004h
ECCP1CON_CCP1Y_POSITION                  equ 0004h
ECCP1CON_CCP1Y_SIZE                      equ 0001h
ECCP1CON_CCP1Y_LENGTH                    equ 0001h
ECCP1CON_CCP1Y_MASK                      equ 0010h
ECCP1CON_CCP1X_POSN                      equ 0005h
ECCP1CON_CCP1X_POSITION                  equ 0005h
ECCP1CON_CCP1X_SIZE                      equ 0001h
ECCP1CON_CCP1X_LENGTH                    equ 0001h
ECCP1CON_CCP1X_MASK                      equ 0020h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0FBEh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0FBEh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0FBFh

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 0FC0h
// bitfield definitions
ADCON2_ADCS_POSN                         equ 0000h
ADCON2_ADCS_POSITION                     equ 0000h
ADCON2_ADCS_SIZE                         equ 0003h
ADCON2_ADCS_LENGTH                       equ 0003h
ADCON2_ADCS_MASK                         equ 0007h
ADCON2_ACQT_POSN                         equ 0003h
ADCON2_ACQT_POSITION                     equ 0003h
ADCON2_ACQT_SIZE                         equ 0003h
ADCON2_ACQT_LENGTH                       equ 0003h
ADCON2_ACQT_MASK                         equ 0038h
ADCON2_ADFM_POSN                         equ 0007h
ADCON2_ADFM_POSITION                     equ 0007h
ADCON2_ADFM_SIZE                         equ 0001h
ADCON2_ADFM_LENGTH                       equ 0001h
ADCON2_ADFM_MASK                         equ 0080h
ADCON2_ADCS0_POSN                        equ 0000h
ADCON2_ADCS0_POSITION                    equ 0000h
ADCON2_ADCS0_SIZE                        equ 0001h
ADCON2_ADCS0_LENGTH                      equ 0001h
ADCON2_ADCS0_MASK                        equ 0001h
ADCON2_ADCS1_POSN                        equ 0001h
ADCON2_ADCS1_POSITION                    equ 0001h
ADCON2_ADCS1_SIZE                        equ 0001h
ADCON2_ADCS1_LENGTH                      equ 0001h
ADCON2_ADCS1_MASK                        equ 0002h
ADCON2_ADCS2_POSN                        equ 0002h
ADCON2_ADCS2_POSITION                    equ 0002h
ADCON2_ADCS2_SIZE                        equ 0001h
ADCON2_ADCS2_LENGTH                      equ 0001h
ADCON2_ADCS2_MASK                        equ 0004h
ADCON2_ACQT0_POSN                        equ 0003h
ADCON2_ACQT0_POSITION                    equ 0003h
ADCON2_ACQT0_SIZE                        equ 0001h
ADCON2_ACQT0_LENGTH                      equ 0001h
ADCON2_ACQT0_MASK                        equ 0008h
ADCON2_ACQT1_POSN                        equ 0004h
ADCON2_ACQT1_POSITION                    equ 0004h
ADCON2_ACQT1_SIZE                        equ 0001h
ADCON2_ACQT1_LENGTH                      equ 0001h
ADCON2_ACQT1_MASK                        equ 0010h
ADCON2_ACQT2_POSN                        equ 0005h
ADCON2_ACQT2_POSITION                    equ 0005h
ADCON2_ACQT2_SIZE                        equ 0001h
ADCON2_ACQT2_LENGTH                      equ 0001h
ADCON2_ACQT2_MASK                        equ 0020h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 0FC1h
// bitfield definitions
ADCON1_PCFG_POSN                         equ 0000h
ADCON1_PCFG_POSITION                     equ 0000h
ADCON1_PCFG_SIZE                         equ 0004h
ADCON1_PCFG_LENGTH                       equ 0004h
ADCON1_PCFG_MASK                         equ 000Fh
ADCON1_VCFG_POSN                         equ 0004h
ADCON1_VCFG_POSITION                     equ 0004h
ADCON1_VCFG_SIZE                         equ 0002h
ADCON1_VCFG_LENGTH                       equ 0002h
ADCON1_VCFG_MASK                         equ 0030h
ADCON1_PCFG0_POSN                        equ 0000h
ADCON1_PCFG0_POSITION                    equ 0000h
ADCON1_PCFG0_SIZE                        equ 0001h
ADCON1_PCFG0_LENGTH                      equ 0001h
ADCON1_PCFG0_MASK                        equ 0001h
ADCON1_PCFG1_POSN                        equ 0001h
ADCON1_PCFG1_POSITION                    equ 0001h
ADCON1_PCFG1_SIZE                        equ 0001h
ADCON1_PCFG1_LENGTH                      equ 0001h
ADCON1_PCFG1_MASK                        equ 0002h
ADCON1_PCFG2_POSN                        equ 0002h
ADCON1_PCFG2_POSITION                    equ 0002h
ADCON1_PCFG2_SIZE                        equ 0001h
ADCON1_PCFG2_LENGTH                      equ 0001h
ADCON1_PCFG2_MASK                        equ 0004h
ADCON1_PCFG3_POSN                        equ 0003h
ADCON1_PCFG3_POSITION                    equ 0003h
ADCON1_PCFG3_SIZE                        equ 0001h
ADCON1_PCFG3_LENGTH                      equ 0001h
ADCON1_PCFG3_MASK                        equ 0008h
ADCON1_VCFG0_POSN                        equ 0004h
ADCON1_VCFG0_POSITION                    equ 0004h
ADCON1_VCFG0_SIZE                        equ 0001h
ADCON1_VCFG0_LENGTH                      equ 0001h
ADCON1_VCFG0_MASK                        equ 0010h
ADCON1_VCFG1_POSN                        equ 0005h
ADCON1_VCFG1_POSITION                    equ 0005h
ADCON1_VCFG1_SIZE                        equ 0001h
ADCON1_VCFG1_LENGTH                      equ 0001h
ADCON1_VCFG1_MASK                        equ 0020h
ADCON1_CHSN3_POSN                        equ 0003h
ADCON1_CHSN3_POSITION                    equ 0003h
ADCON1_CHSN3_SIZE                        equ 0001h
ADCON1_CHSN3_LENGTH                      equ 0001h
ADCON1_CHSN3_MASK                        equ 0008h
ADCON1_VCFG01_POSN                       equ 0004h
ADCON1_VCFG01_POSITION                   equ 0004h
ADCON1_VCFG01_SIZE                       equ 0001h
ADCON1_VCFG01_LENGTH                     equ 0001h
ADCON1_VCFG01_MASK                       equ 0010h
ADCON1_VCFG11_POSN                       equ 0005h
ADCON1_VCFG11_POSITION                   equ 0005h
ADCON1_VCFG11_SIZE                       equ 0001h
ADCON1_VCFG11_LENGTH                     equ 0001h
ADCON1_VCFG11_MASK                       equ 0020h

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 0FC2h
// bitfield definitions
ADCON0_GO_NOT_DONE_POSN                  equ 0001h
ADCON0_GO_NOT_DONE_POSITION              equ 0001h
ADCON0_GO_NOT_DONE_SIZE                  equ 0001h
ADCON0_GO_NOT_DONE_LENGTH                equ 0001h
ADCON0_GO_NOT_DONE_MASK                  equ 0002h
ADCON0_ADON_POSN                         equ 0000h
ADCON0_ADON_POSITION                     equ 0000h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0001h
ADCON0_GO_nDONE_POSN                     equ 0001h
ADCON0_GO_nDONE_POSITION                 equ 0001h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0002h
ADCON0_CHS_POSN                          equ 0002h
ADCON0_CHS_POSITION                      equ 0002h
ADCON0_CHS_SIZE                          equ 0004h
ADCON0_CHS_LENGTH                        equ 0004h
ADCON0_CHS_MASK                          equ 003Ch
ADCON0_DONE_POSN                         equ 0001h
ADCON0_DONE_POSITION                     equ 0001h
ADCON0_DONE_SIZE                         equ 0001h
ADCON0_DONE_LENGTH                       equ 0001h
ADCON0_DONE_MASK                         equ 0002h
ADCON0_CHS0_POSN                         equ 0002h
ADCON0_CHS0_POSITION                     equ 0002h
ADCON0_CHS0_SIZE                         equ 0001h
ADCON0_CHS0_LENGTH                       equ 0001h
ADCON0_CHS0_MASK                         equ 0004h
ADCON0_CHS1_POSN                         equ 0003h
ADCON0_CHS1_POSITION                     equ 0003h
ADCON0_CHS1_SIZE                         equ 0001h
ADCON0_CHS1_LENGTH                       equ 0001h
ADCON0_CHS1_MASK                         equ 0008h
ADCON0_CHS2_POSN                         equ 0004h
ADCON0_CHS2_POSITION                     equ 0004h
ADCON0_CHS2_SIZE                         equ 0001h
ADCON0_CHS2_LENGTH                       equ 0001h
ADCON0_CHS2_MASK                         equ 0010h
ADCON0_CHS3_POSN                         equ 0005h
ADCON0_CHS3_POSITION                     equ 0005h
ADCON0_CHS3_SIZE                         equ 0001h
ADCON0_CHS3_LENGTH                       equ 0001h
ADCON0_CHS3_MASK                         equ 0020h
ADCON0_ADCAL_POSN                        equ 0007h
ADCON0_ADCAL_POSITION                    equ 0007h
ADCON0_ADCAL_SIZE                        equ 0001h
ADCON0_ADCAL_LENGTH                      equ 0001h
ADCON0_ADCAL_MASK                        equ 0080h
ADCON0_GO_DONE_POSN                      equ 0001h
ADCON0_GO_DONE_POSITION                  equ 0001h
ADCON0_GO_DONE_SIZE                      equ 0001h
ADCON0_GO_DONE_LENGTH                    equ 0001h
ADCON0_GO_DONE_MASK                      equ 0002h
ADCON0_GO_POSN                           equ 0001h
ADCON0_GO_POSITION                       equ 0001h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0002h
ADCON0_NOT_DONE_POSN                     equ 0001h
ADCON0_NOT_DONE_POSITION                 equ 0001h
ADCON0_NOT_DONE_SIZE                     equ 0001h
ADCON0_NOT_DONE_LENGTH                   equ 0001h
ADCON0_NOT_DONE_MASK                     equ 0002h
ADCON0_nDONE_POSN                        equ 0001h
ADCON0_nDONE_POSITION                    equ 0001h
ADCON0_nDONE_SIZE                        equ 0001h
ADCON0_nDONE_LENGTH                      equ 0001h
ADCON0_nDONE_MASK                        equ 0002h
ADCON0_GODONE_POSN                       equ 0001h
ADCON0_GODONE_POSITION                   equ 0001h
ADCON0_GODONE_SIZE                       equ 0001h
ADCON0_GODONE_LENGTH                     equ 0001h
ADCON0_GODONE_MASK                       equ 0002h

